content/roam/20220523171706-jd_dl_devlop_engineer.org
:PROPERTIES:
:ID:       cb2c81f0-5778-45eb-9379-f6d53df72958
:END:
#+title: JD-DL-Devlop_Engineer

#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: ctexart
#+LATEX_CLASS_OPTIONS: [a4paper, 11pt]
#+LATEX_HEADER: \usepackage[UTF8,fontset=song]{ctex}



* 基本信息
** 职位名称
深度学习应用开发工程师
** 所属部门
智能系统部
** 所属分部
前沿开发
** 职位类别
软件开发，数据开发
** 适用范围
深度学习应用开发工程师岗位
* 主要职责
** 概述
+ 运用深度神经网络对车辆运行和运营大数据进行分析，研究优化车辆行驶和运营的深度学习模型和算法
+ 进行深度强化学习，大数据时间序列分析，生成性模型和图神经网络相关的前沿应用
+ 支持公司大数据业务模型开发和部署
+ 参与上述领域算法的优化和移动端推理部署
+ 与产品团队紧密合作，确保算法成功产品化
+ 关注特定方向的研究进展，行业新技术动态
** 职责描述
*** 开发研究
+ 运用深度强化学习技术对新能源车辆运行大数据进行优化分析，支持新能源汽车行业新业务模式的探索
+ 探索利用离线强化学习、联邦学习等前沿深度学习技术更新深度学习业务模型
+ 应用基于大数据的时间序列分析方法和无监督方法进行系统运行状态分析和预测
+ 探索深度图神经网络应用于物流运营优化调度
*** 应用部署
+ 容器化部署
+ 建立和配置数据流水
+ 支持建立机器学习运营（MLOps)，云端部署机器学习模型算法
+ 支持运营优化和匹配
** 工作关系
*** 直接上级
前沿开发高级技术总监
*** 直接下级
无
*** 内部联系
产品开发部门：电动力总成及电子电器，商业智能
*** 外部联系
云服务供应商
* 任职资格
** 教育程度
*** 学历
本科或以上
*** 专业
人工智能类计算机类或自动化类
** 工作经验（以下之一）
+ 具备在学校有至少半年以上中小型深度学习项目开发经验
+ 在代码托管平台 github/gitlab/gitee 有深度参与开发维护的深度学习项目
+ 在企业研究机构从事过深度学习研究或者开发项目
** 知识/技能
*** 专业知识
+ 机器学习基础理论
+ 了解深度学习理论中的卷积网，强化学习，生成性对抗网络（GAN），图神经网络，大型语言模型等
*** 专业证书
无特殊要求
*** 英语
+ 能熟练阅读和理解英语技术文档和相关领域研究文献
+ 能编写基本的英语技术文档和指导书
*** 计算机
+ 可熟练使用 python 编程
+ 熟悉以下一个或多个大数据应用程序包
  + tensorflow, pytorch
  + pandas, numpy, scipy, scikit-learn
+ 具备扎实的 Linux 基础应用知识
  + 熟练使用 Git
  + 了解并能使用 docker
  + 了解 markdown, rST, asciidoc, orgmode 或 doxygen
*** 其他技能
+ 有敏捷开发经验者为佳
** 素质能力
*** 基础项
诚信正直，有创新精神
*** 业务素质
具备不妥协的高标准质量意识
** 其他要求
+ 有不断持续改进工作的追求
+ 有较强的自我学习能力
