docs/20220523171706-jd_dl_devlop_engineer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JD-DL-Devlop_Engineer</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">JD-DL-Devlop<sub>Engineer</sub></h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb605583">基本信息</a>
<ul>
<li><a href="#orgb712ad1">职位名称</a></li>
<li><a href="#orgdf2673c">所属部门</a></li>
<li><a href="#orgc1e6357">所属分部</a></li>
<li><a href="#orge04f7f1">职位类别</a></li>
<li><a href="#org4f3aebc">适用范围</a></li>
</ul>
</li>
<li><a href="#orge968568">主要职责</a>
<ul>
<li><a href="#org31bbb63">概述</a></li>
<li><a href="#org6f2fbc1">职责描述</a>
<ul>
<li><a href="#org42e9830">开发研究</a></li>
<li><a href="#org899c53a">应用部署</a></li>
</ul>
</li>
<li><a href="#org5188942">工作关系</a>
<ul>
<li><a href="#org2eb10db">直接上级</a></li>
<li><a href="#orgbe50cd1">直接下级</a></li>
<li><a href="#orgf021998">内部联系</a></li>
<li><a href="#org09ac2ed">外部联系</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2808ac2">任职资格</a>
<ul>
<li><a href="#org7344d27">教育程度</a>
<ul>
<li><a href="#org0cb3c7a">学历</a></li>
<li><a href="#org2b3079a">专业</a></li>
</ul>
</li>
<li><a href="#orga69b002">工作经验（以下之一）</a></li>
<li><a href="#org95c7656">知识/技能</a>
<ul>
<li><a href="#orge0ef4aa">专业知识</a></li>
<li><a href="#org2660ca1">专业证书</a></li>
<li><a href="#org59d79a3">英语</a></li>
<li><a href="#org5e095d9">计算机</a></li>
<li><a href="#org81a1ae6">其他技能</a></li>
</ul>
</li>
<li><a href="#org66607cd">素质能力</a>
<ul>
<li><a href="#org2551ee1">基础项</a></li>
<li><a href="#orgbadbab2">业务素质</a></li>
</ul>
</li>
<li><a href="#org6e33398">其他要求</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-orgb605583" class="outline-2">
<h2 id="orgb605583">基本信息</h2>
<div class="outline-text-2" id="text-orgb605583">
</div>
<div id="outline-container-orgb712ad1" class="outline-3">
<h3 id="orgb712ad1">职位名称</h3>
<div class="outline-text-3" id="text-orgb712ad1">
<p>
深度学习应用开发工程师
</p>
</div>
</div>
<div id="outline-container-orgdf2673c" class="outline-3">
<h3 id="orgdf2673c">所属部门</h3>
<div class="outline-text-3" id="text-orgdf2673c">
<p>
智能系统部
</p>
</div>
</div>
<div id="outline-container-orgc1e6357" class="outline-3">
<h3 id="orgc1e6357">所属分部</h3>
<div class="outline-text-3" id="text-orgc1e6357">
<p>
前沿开发
</p>
</div>
</div>
<div id="outline-container-orge04f7f1" class="outline-3">
<h3 id="orge04f7f1">职位类别</h3>
<div class="outline-text-3" id="text-orge04f7f1">
<p>
软件开发，数据开发
</p>
</div>
</div>
<div id="outline-container-org4f3aebc" class="outline-3">
<h3 id="org4f3aebc">适用范围</h3>
<div class="outline-text-3" id="text-org4f3aebc">
<p>
深度学习应用开发工程师岗位
</p>
</div>
</div>
</div>
<div id="outline-container-orge968568" class="outline-2">
<h2 id="orge968568">主要职责</h2>
<div class="outline-text-2" id="text-orge968568">
</div>
<div id="outline-container-org31bbb63" class="outline-3">
<h3 id="org31bbb63">概述</h3>
<div class="outline-text-3" id="text-org31bbb63">
<ul class="org-ul">
<li>运用深度神经网络对车辆运行和运营大数据进行分析，研究优化车辆行驶和运营的深度学习模型和算法</li>
<li>进行深度强化学习，大数据时间序列分析，生成性模型和图神经网络相关的前沿应用</li>
<li>支持公司大数据业务模型开发和部署</li>
<li>参与上述领域算法的优化和移动端推理部署</li>
<li>与产品团队紧密合作，确保算法成功产品化</li>
<li>关注特定方向的研究进展，行业新技术动态</li>
</ul>
</div>
</div>
<div id="outline-container-org6f2fbc1" class="outline-3">
<h3 id="org6f2fbc1">职责描述</h3>
<div class="outline-text-3" id="text-org6f2fbc1">
</div>
<div id="outline-container-org42e9830" class="outline-4">
<h4 id="org42e9830">开发研究</h4>
<div class="outline-text-4" id="text-org42e9830">
<ul class="org-ul">
<li>运用深度强化学习技术对新能源车辆运行大数据进行优化分析，支持新能源汽车行业新业务模式的探索</li>
<li>探索利用离线强化学习、联邦学习等前沿深度学习技术更新深度学习业务模型</li>
<li>应用基于大数据的时间序列分析方法和无监督方法进行系统运行状态分析和预测</li>
<li>探索深度图神经网络应用于物流运营优化调度</li>
</ul>
</div>
</div>
<div id="outline-container-org899c53a" class="outline-4">
<h4 id="org899c53a">应用部署</h4>
<div class="outline-text-4" id="text-org899c53a">
<ul class="org-ul">
<li>容器化部署</li>
<li>建立和配置数据流水</li>
<li>支持建立机器学习运营（MLOps)，云端部署机器学习模型算法</li>
<li>支持运营优化和匹配</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5188942" class="outline-3">
<h3 id="org5188942">工作关系</h3>
<div class="outline-text-3" id="text-org5188942">
</div>
<div id="outline-container-org2eb10db" class="outline-4">
<h4 id="org2eb10db">直接上级</h4>
<div class="outline-text-4" id="text-org2eb10db">
<p>
前沿开发高级技术总监
</p>
</div>
</div>
<div id="outline-container-orgbe50cd1" class="outline-4">
<h4 id="orgbe50cd1">直接下级</h4>
<div class="outline-text-4" id="text-orgbe50cd1">
<p>
无
</p>
</div>
</div>
<div id="outline-container-orgf021998" class="outline-4">
<h4 id="orgf021998">内部联系</h4>
<div class="outline-text-4" id="text-orgf021998">
<p>
产品开发部门：电动力总成及电子电器，商业智能
</p>
</div>
</div>
<div id="outline-container-org09ac2ed" class="outline-4">
<h4 id="org09ac2ed">外部联系</h4>
<div class="outline-text-4" id="text-org09ac2ed">
<p>
云服务供应商
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org2808ac2" class="outline-2">
<h2 id="org2808ac2">任职资格</h2>
<div class="outline-text-2" id="text-org2808ac2">
</div>
<div id="outline-container-org7344d27" class="outline-3">
<h3 id="org7344d27">教育程度</h3>
<div class="outline-text-3" id="text-org7344d27">
</div>
<div id="outline-container-org0cb3c7a" class="outline-4">
<h4 id="org0cb3c7a">学历</h4>
<div class="outline-text-4" id="text-org0cb3c7a">
<p>
本科或以上
</p>
</div>
</div>
<div id="outline-container-org2b3079a" class="outline-4">
<h4 id="org2b3079a">专业</h4>
<div class="outline-text-4" id="text-org2b3079a">
<p>
人工智能类计算机类或自动化类
</p>
</div>
</div>
</div>
<div id="outline-container-orga69b002" class="outline-3">
<h3 id="orga69b002">工作经验（以下之一）</h3>
<div class="outline-text-3" id="text-orga69b002">
<ul class="org-ul">
<li>具备在学校有至少半年以上中小型深度学习项目开发经验</li>
<li>在代码托管平台 github/gitlab/gitee 有深度参与开发维护的深度学习项目</li>
<li>在企业研究机构从事过深度学习研究或者开发项目</li>
</ul>
</div>
</div>
<div id="outline-container-org95c7656" class="outline-3">
<h3 id="org95c7656">知识/技能</h3>
<div class="outline-text-3" id="text-org95c7656">
</div>
<div id="outline-container-orge0ef4aa" class="outline-4">
<h4 id="orge0ef4aa">专业知识</h4>
<div class="outline-text-4" id="text-orge0ef4aa">
<ul class="org-ul">
<li>机器学习基础理论</li>
<li>了解深度学习理论中的卷积网，强化学习，生成性对抗网络（GAN），图神经网络，大型语言模型等</li>
</ul>
</div>
</div>
<div id="outline-container-org2660ca1" class="outline-4">
<h4 id="org2660ca1">专业证书</h4>
<div class="outline-text-4" id="text-org2660ca1">
<p>
无特殊要求
</p>
</div>
</div>
<div id="outline-container-org59d79a3" class="outline-4">
<h4 id="org59d79a3">英语</h4>
<div class="outline-text-4" id="text-org59d79a3">
<ul class="org-ul">
<li>能熟练阅读和理解英语技术文档和相关领域研究文献</li>
<li>能编写基本的英语技术文档和指导书</li>
</ul>
</div>
</div>
<div id="outline-container-org5e095d9" class="outline-4">
<h4 id="org5e095d9">计算机</h4>
<div class="outline-text-4" id="text-org5e095d9">
<ul class="org-ul">
<li>可熟练使用 python 编程</li>
<li>熟悉以下一个或多个大数据应用程序包
<ul class="org-ul">
<li>tensorflow, pytorch</li>
<li>pandas, numpy, scipy, scikit-learn</li>
</ul></li>
<li>具备扎实的 Linux 基础应用知识
<ul class="org-ul">
<li>熟练使用 Git</li>
<li>了解并能使用 docker</li>
<li>了解 markdown, rST, asciidoc, orgmode 或 doxygen</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org81a1ae6" class="outline-4">
<h4 id="org81a1ae6">其他技能</h4>
<div class="outline-text-4" id="text-org81a1ae6">
<ul class="org-ul">
<li>有敏捷开发经验者为佳</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org66607cd" class="outline-3">
<h3 id="org66607cd">素质能力</h3>
<div class="outline-text-3" id="text-org66607cd">
</div>
<div id="outline-container-org2551ee1" class="outline-4">
<h4 id="org2551ee1">基础项</h4>
<div class="outline-text-4" id="text-org2551ee1">
<p>
诚信正直，有创新精神
</p>
</div>
</div>
<div id="outline-container-orgbadbab2" class="outline-4">
<h4 id="orgbadbab2">业务素质</h4>
<div class="outline-text-4" id="text-orgbadbab2">
<p>
具备不妥协的高标准质量意识
</p>
</div>
</div>
</div>
<div id="outline-container-org6e33398" class="outline-3">
<h3 id="org6e33398">其他要求</h3>
<div class="outline-text-3" id="text-org6e33398">
<ul class="org-ul">
<li>有不断持续改进工作的追求</li>
<li>有较强的自我学习能力</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.7)</p>
</div>
</body>
</html>